Constructor
- constructor(numOfRoom) : สร้างอาเรย์ตามจํานวนที2ระบุและกาํหนดลงในค่า property rooms: ห้อง
Properties
- rooms : ห้องพัก ประเภทอาเรย์โดยออบเจ็คห้อง ประกอบไปด้วย {roomId : รหัสห้อง ประเภทตัวเลข, 
available : สถานะค่าตั้งต้น เป็น true ประเภท ตรรกะ}
Methods
- reserva2on(roomId) : จองห้องพัก
ให้ทําการรับ รหัสห้อง เพื่อตั้งค่า available : สถานะใน property rooms : ห้อง เปลี่ยนเป็น false และ
คืนค่าออบเจ็คห้อง ที่จองสําเร็จกรณีไม่พบ รหัสห้อง ที่
ระบุให้คืนค่าเป็น -1 กรณีเป็น false ถูกจองอยู่แล้ว
ให้คืนค่าเป็นสตริง "invalid"
- cancelReserva2on(roomId) : ยกเลิกการจองห้องพักด้วยรหัสห้อง
ให้ทําการรับ รหัสห้อง เพื่อตั้งค่า available : สถานะในproperty rooms : ห้อง เปลี่ยนเป็น true กรณีไม่
พบ รหัสห้อง ที่ระบุให้คืนค้าเป็น -1 กรณีเป็น true ไม่ไดถู้กจองอยู่แล้วให้คืนค่าเป็นสตริง "invalid"
- getRoomAvailable() : ดึงรายการห้องพักที่ว่างทั้งหมด
ใหคืนค่าเป็นอาเรย์ของออบเจ็คห้องที่มีavailable : สถานะเป็น true ทั้งหมด
